# LayeredNdfType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedLayered..::..LayeredNdfType Property
AdvancedLayered Class See Also
---
The property labeled "NDF" from the "AdvancedLayered" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string LayeredNdfType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayeredNdfType As String
	Get
```

Visual C++
---
```text
public:
static property String^ LayeredNdfType {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "LayeredNdfType".
# See Also
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace